import "./pages/style.css";

import { Menu } from "./scripts/Menu.js";


(function () {
/*------------------------------------------------------------------------------
Переменные
------------------------------------------------------------------------------*/

const root = document.querySelector('.root');
const navBar = root.querySelector('.header__menu');

const menu = new Menu();


/*------------------------------------------------------------------------------
Слушатели событий
------------------------------------------------------------------------------*/
navBar.addEventListener('click', function(evt) {
  console.log(evt.target)
});


/*------------------------------------------------------------------------------
Функции
------------------------------------------------------------------------------*/



})